In [1]:
import pandas as pd

# **Intéragir avec un fichier d'Excel**

Comme pour le CSV, Pandas ne sais que les lires et les écrires.  
Idem pour un fichier html.

Il faut utiliser `xlrd`.  
C'est par défaut installer avec Anaconda.  
S'il est absent `conda install xlrd` ou `pip install xlrd`.

In [2]:
notes = pd.read_excel('notes_eleves.xlsx')

Par défaut, la 1ère feuille est importée.

In [3]:
notes

   Prenom  age  note_maths  note_physique  note_informatique
0  Claire   21          12             15                 10
1   Amine   19          10             10                 11
2  Karine   20          12             15                 20
3  Samira   19          13             13                 18
4   Sarah   18          12             10                  9
5    Lina   20          13             15                 16

In [4]:
# Créer la colonne Moyenne
notes['Moyenne']=notes[['note_maths','note_physique','note_informatique']].mean(axis=1)
notes

   Prenom  age  note_maths  note_physique  note_informatique    Moyenne
0  Claire   21          12             15                 10  12.333333
1   Amine   19          10             10                 11  10.333333
2  Karine   20          12             15                 20  15.666667
3  Samira   19          13             13                 18  14.666667
4   Sarah   18          12             10                  9  10.333333
5    Lina   20          13             15                 16  14.666667

In [5]:
# Exporter
notes.to_excel('notes_etudiants.xlsx', index=False)

In [6]:
# Importer la seconde
notes2 = pd.read_excel('notes_eleves.xlsx', sheet_name='notes2')

In [7]:
notes2

   Prenom  Age  Note_Anglais  Note_Français  Moyenne
0  Claire   21            10             12     11.0
1   Amine   19             9             13     11.0
2  Karine   15            11             11     11.0
3  Samira   20            12             13     12.5
4   Sarah   14            16             18     17.0
5    Lina   20            13             12     12.5